# Importing Libraries

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.cluster import KMeans
from sklearn.preprocessing import StandardScaler
import warnings

warnings.filterwarnings("ignore")

sns.set_theme(style="whitegrid")

# Load and Inspect data

In [20]:
#  Load the dataset
data = pd.read_csv(r"C:\Users\ansar\Downloads\bank_transactions.csv")

In [21]:
# explore the dataset
df.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,10-01-1994,F,JAMSHEDPUR,17819.05,02-08-2016,143207,25.0
1,T2,C2142763,04-04-1957,M,JHAJJAR,2270.69,02-08-2016,141858,27999.0
2,T3,C4417068,26-11-1996,F,MUMBAI,17874.44,02-08-2016,142712,459.0
3,T4,C5342380,14-09-1973,F,MUMBAI,866503.21,02-08-2016,142714,2060.0
4,T5,C9031234,24-03-1988,F,NAVI MUMBAI,6714.43,02-08-2016,181156,1762.5

In [22]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   TransactionID            20000 non-null  object
 1   CustomerID               20000 non-null  object
 2   CustomerDOB              19928 non-null  object
 3   CustGender               19989 non-null  object
 4   CustLocation             19999 non-null  object
 5   CustAccountBalance       19973 non-null  float64
 6   TransactionDate          20000 non-null  object
 7   TransactionTime          20000 non-null  int64
 8   TransactionAmount (INR)  20000 non-null  float64
dtypes: float64(2), int64(1), object(6)
memory usage: 1.4+ MB

In [23]:
# Convert the "TransactionDate" column to datetime format
data["TransactionDate"] = pd.to_datetime(data["TransactionDate"], format="%d-%m-%Y")

In [27]:
# Drop rows with missing values
data.dropna(inplace=True)

In [29]:
# Select numeric features for clustering
numeric_features =data[[
    "TransactionAmount (INR)",
    "CustAccountBalance",]]

In [30]:
data.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,10-01-1994,F,JAMSHEDPUR,17819.05,2016-08-02,143207,25.0
1,T2,C2142763,04-04-1957,M,JHAJJAR,2270.69,2016-08-02,141858,27999.0
2,T3,C4417068,26-11-1996,F,MUMBAI,17874.44,2016-08-02,142712,459.0
3,T4,C5342380,14-09-1973,F,MUMBAI,866503.21,2016-08-02,142714,2060.0
4,T5,C9031234,24-03-1988,F,NAVI MUMBAI,6714.43,2016-08-02,181156,1762.5

In [31]:
# Standardize the data
scaler = StandardScaler()
scaled_features = scaler.fit_transform(numeric_features)